Revit 2024 API
ViewFamilyType Class
 Represents a type of a Revit view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ViewFamilyType : ElementType
Visual Basic
Public Class ViewFamilyType _
	Inherits ElementType
Visual C++
public ref class ViewFamilyType : public ElementType
Remarks
 ViewFamilyTypes represent possible types for a Revit view and contain view type related properties and options such as the default template associated to views created from this type. They are commonly input to new View creation methods in the Revit API.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.ViewFamilyType
See Also
ViewFamilyType Members
Autodesk.Revit.DB Namespace